RedditOnRails/app/models/user.rb

  def self.find_by_creds(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "stephen"], ["LIMIT", 1]]