RedditOnRails/app/views/posts/new.html.erb

    <input type="hidden" name="post[sub_ids][]" value="">
    <% Sub.all.each do |sub| %>
    <label> <%= sub.title %>
      <input type="checkbox" name="post[sub_id][]" value="<%= sub.id %>" <%= "checked" if @post.sub_ids.include?(sub.id) %> />
---
SELECT "subs".* FROM "subs"