RedditOnRails/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "asfaspofia"], ["user_id", 8], ["post_id", 26], ["created_at", "2018-09-18 23:55:59.468533"], ["updated_at", "2018-09-18 23:55:59.468533"]]
---
  def create
    comment = Comment.new(comment_params)
    comment.user_id = current_user.id
    comment.post_id = params[:post_id]
    comment.save