RedditOnRails/app/controllers/posts_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def new
    @post = Post.new
    @sub = Sub.find(params[:sub_id])

INSERT INTO "posts" ("title", "url", "content", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test3"], ["url", "url"], ["content", "content"], ["user_id", 8]]
---
  def create
    debugger
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    #@post.sub_id = params[:sub_id]

    if @post.save