RedditOnRails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.sub_id = params[:sub_id]

    if @post.save
---
INSERT INTO "postsubs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 27], ["sub_id", 1], ["created_at", "2018-09-19 00:13:16.388252"], ["updated_at", "2018-09-19 00:13:16.388252"]]