RedditOnRails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "first test"], ["description", "hello world"], ["user_id", 5]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save